[
    {
        "website_url": "https://en.wikipedia.org/wiki/Wikipedia:Very_short_featured_articles",
        "content": [
            "There has often been discussion about whether very short articles can attain Featured article (FA) status.",
            "Some editors are opposed to short articles at Featured article candidates (FAC). Many bring up fair arguments, such as potential overflow of FACs, lack of reviewers, and loss of quality main page TFAs. Other FAC reviewers argue that any article which meets Wikipedia's notability requirements can become featured.  So, should a 500-word (or less) article be able to make FA?",
            "Featured articles under 400 words have been proposed. WP:GA was initially designed for such articles, but Wikipedia has appeared to have moved beyond that concept.",
            "Some examples of current very short featured articles:",
            "For a complete list, see Featured articles by size.",
            "From the featured article criteria:",
            "A featured article exemplifies our very best work and ... It is—",
            "The length of an article doesn't determine its quality; it's the thoroughness, accuracy, and relevance of its content that matters most. Wikipedia's Featured Article status reflects this emphasis on quality over quantity. While achieving this status relies on comprehensive coverage and adherence to strict editorial guidelines, simply adding material to lengthen an article isn't advisable. Instead, the focus should be on presenting clear and concise information that effectively communicates the subject matter. Collaborative efforts by knowledgeable editors can ensure that articles attain Featured status by accurately representing all relevant facts and details without unnecessary padding. Ultimately, whether short or long, an article's value lies in its ability to inform and engage readers effectively."
        ]
    },
    {
        "website_url": "https://en.wikipedia.org/wiki/Wikipedia:Essays",
        "content": [
            "Essays, as used by Wikipedia editors, typically contain advice or opinions of one or more editors. The purpose of an essay is to aid or comment on the encyclopedia but not on any unrelated causes. Essays have no official status and do not speak for the Wikipedia community because they may be created and edited without overall community oversight.  Following the instructions or advice given in an essay is optional. Generally soft advice belongs in an essay, thus avoiding instruction creep in Wikipedia's official protocols. There are over 2,000 essays on a wide range of Wikipedia-related topics.  Wikipedia policy says, “Essays…that overtly contradict consensus, belong in the user namespace”.",
            "Although essays are not policies or guidelines, many are worthy of consideration. Policies and guidelines cannot cover all circumstances. Consequently, many essays serve as interpretations of or commentary on perceived community norms for specific topics and situations. The value of an essay should be understood in context, using common sense and discretion. Essays can be written by anyone and can be long monologues or short theses, serious or humorous. Essays may represent widespread norms or minority viewpoints.  An essay, as well as being useful, can potentially be a divisive means of espousing a point of view. Although an essay should not be used to create an alternative rule set, the Wikipedia community has historically tolerated a wide range of Wikipedia-related subjects and viewpoints on user pages.",
            "The difference between policies, guidelines, and some essays on Wikipedia may be obscure. Essays vary in popularity and how much they are followed and referred to. Editors should defer to official policies or guidelines when essays, information pages or template documentation pages are inconsistent with established community standards and principles.",
            "Avoid \"quoting\" essays as though they are policy—including this  explanatory supplement page. Essays, information pages and template documentation pages can be written without much—if any—debate, as opposed to Wikipedia policies that have been thoroughly vetted by the community (see WP:Local consensus for details). In Wikipedia discussions, editors may refer to essays, provided that they do not hold them out as consensus or policy. Proposals for new guidelines and policies require discussion and a high level of consensus from the entire community for promotion. See Wikipedia:How to contribute to Wikipedia guidance and Wikipedia:Policy writing is hard for more information.",
            "Essays are located in the  Wikipedia namespace (e.g., Wikipedia:Reasonability rule) and in User namespaces (e.g., User:Jimbo Wales/Statement of principles). The Help namespace contains pages which provide factual (usually technical) information on using Wikipedia and its software (see below). The {{Essay}}-family templates (with several variants like {{Notability essay}} and {{WikiProject advice}}), versus the {{Guideline}} (and variants, like {{MoS guideline}}) and {{Policy}} templates give an indication of a page's status within the community. Some essays at one time were proposed policies or guidelines, but they could not gain consensus overall; as indicated by the template {{Failed proposal}}. Other essays that at one time had consensus, but are no longer relevant, are tagged with the template {{Historical}}. Essays currently nominated for policy status are indicated by the banner {{Proposed}}. See Wikipedia:Template messages/Wikipedia namespace for a listing of namespace banners.",
            "Essays in the Wikipedia namespace – which are never to be put in the main (encyclopedia article) namespace – typically address some aspect of working in Wikipedia. They have not been formally adopted as guidelines or policies by the community at large, but typically edited by the community. Some are widely accepted as part of the Wikipedia gestalt, and have a significant degree of influence during discussions (like \"guideline supplements\" WP:Tendentious editing, WP:Bold, revert, discuss cycle, and WP:Competence is required).",
            "Many essays, however, are obscure, single-author pieces.  Essays may be moved into userspace as user essays (see below), or even deleted, if they are found to be problematic.[1]  Occasionally, even longstanding, community-edited essays may be removed or radically revised if community norms shift.[2]",
            "Wikipedia's  how-to and information pages are typically edited by the community and can also be found in the help namespace. They generally  provide technical and factual information about Wikipedia  or supplement guidelines and policies in greater detail. Where \"essay pages\"  often offer advice or opinions through viewpoints, information pages are intended  to clarity and explain current community practices in an impartial way (e.g.,  Wikipedia:Administration).",
            "WikiProjects are groups of editors who  work together. Advice pages written by these groups are formally considered the same as pages written by anyone else, that is, they are essays unless and until they have been formally adopted as community-wide guidelines or policies. WikiProjects are encouraged to write essays explaining how the community's policies and guidelines should be applied to their areas of interest and expertise (e.g.,  Wikipedia:WikiProject Bibliographies#Recommended structure).",
            "According to Wikipedia policy, \"Essays that the author does not want others to edit, or that are found to contradict widespread consensus, belong in the user namespace.\"  These are similar to essays placed in the Wikipedia namespace; however, they are often authored/edited by only one person, and may represent a strictly personal viewpoint about Wikipedia or its processes (e.g., User:Jehochman/Responding to rudeness). Some of them are widely respected by other editors, and even occasionally have an effect on policy (e.g., the WP:General notability guideline originated in a user essay).",
            "Writings that contradict policy are somewhat tolerated within the User namespace. The author of a personal essay located in their user space has the prerogative to revert any changes made to it by any other user, within reason.  Polemics in the form of personal attacks against particular people, groups, real-life ideas (e.g. artists or politicians), or against Wikipedia itself, are generally deleted at MFD, as unconstructive or disruptive. Likewise, advocacy of fringe POV and pushing of fringe content and conspiracy theories is not tolerated. Wikipedia is a mainstream encyclopedia that sides with RS and does not promote content based on unreliable sources. Such content is considered WP:UNDUE.",
            "The Wikimedia Foundation's Meta-wiki was envisioned as the original place for editors to comment on and discuss Wikipedia, although the \"Wikipedia\" project space has since taken over most of that role. Many historical essays can still be found at Meta.Wikimedia.org.",
            "It is generally preferable that inactive WikiProjects not be tagged as \"Historical \", but instead be marked as {{WikiProject status|inactive}} or {{WikiProject status|Defunct}}. See WP:INACTIVEWP for more details.",
            "Before creating an essay, it is a good idea to check if similar essays already exist. Although there is no guideline or policy that explicitly prohibits it, writing redundant essays is discouraged. Avoid creating essays just to prove a point or game the system. Essays that violate one or more Wikipedia policies, such as spam, personal attacks, copyright violations, or what Wikipedia is not  tend to get deleted or transferred to user space.",
            "You do not have to have created an essay to improve it. If an essay already exists, you can add to, remove from, or modify it as you wish, provided that you use good judgment. However, essays placed in the User: namespace are often—though not always—meant to represent the viewpoint of one user only. You should usually not substantively edit someone else's user essay without permission. To be on the safe side, discuss any edits not covered by REFACTOR and MINOR before making them. If the original author is no longer active or available, seek consensus on the essay's talk page (other editors who have worked on the essay are likely to care about it), or just write a new one.",
            "Wikipedia:Essay directory lists about 2100 essays to allow searching for key words or terms with your browser. Essays can also be navigated via categories, the navigation template,  or by a custom search box (as seen below)."
        ]
    },
    {
        "website_url": "https://en.wikipedia.org/wiki/Wikipedia:Policies_and_guidelines",
        "content": [
            "Wikipedia's policies and guidelines are developed by the community to describe best practices, clarify principles, resolve conflicts, and otherwise further our goal of creating a free, reliable encyclopedia. There is no need to read any policy or guideline pages to start editing. The five pillars are a popular summary of the most pertinent principles.",
            "Although Wikipedia generally does not have hard-and-fast rules, policies and guidelines are standards all users should normally follow, with guidelines providing guidance in specific contexts. Policies and guidelines should be applied using reason and common sense. Technically, the policy and guideline pages are not the policy and guidelines in and of themselves. The actual policies and guidelines are behaviors practiced by most editors.",
            "This policy page specifies the community standards related to the organization, life cycle, maintenance of, and adherence to policies, guidelines, and related pages of the English Wikipedia. It does not cover other editions of Wikipedia.",
            "Wikipedia is operated by the not-for-profit Wikimedia Foundation, which reserves certain legal rights—see the Wikimedia Foundation's Policies page for a list of its policies. See also Role of Jimmy Wales. Nevertheless, normally Wikipedia is a self-governing project run by its community. Its policies and guidelines are intended to reflect the consensus of the community.",
            "Policies have wide acceptance among editors and describe standards all users should normally follow. All policy pages are in Wikipedia:List of policies and guidelines and Category:Wikipedia policies. For summaries of key policies, see List of policies.",
            "Guidelines are sets of best practices supported by consensus. Editors should attempt to follow guidelines, though they are best treated with common sense, and occasional exceptions may apply. Guideline pages can be found in Wikipedia:List of policies and guidelines and Category:Wikipedia guidelines. For summaries of key guidelines, see List of guidelines.",
            "Essays are the opinion or advice of an editor or group of editors. They may not be supported by a widespread consensus. They do not necessarily speak for the entire community and may be created and written without approval. Essays the author does not want others to edit, or that overtly contradict consensus, belong in the user namespace.",
            "Other administration pages in the project namespace include:",
            "Use common sense in interpreting and applying policies and guidelines; rules have occasional exceptions. However, those who violate the spirit of a rule may be reprimanded or sanctioned even if they do not technically break the rule.",
            "Whether a policy or guideline is an accurate description of best practice is determined through consensus.",
            "On discussion pages and in edit summaries, shortcuts are often used to refer to policies and guidelines; for example, WP:NOR (no original research), WP:NPOV (neutral point of view) and WP:BLP (biographies of living persons). Similar shortcuts are also used for other types of project pages like essays and how-to guides. Thus a shortcut does not necessarily imply the linked page has policy or guideline status or has been widely accepted by the community.",
            "When referencing shortcuts or policy pages, verify they support the points you're making. The names of the policy and guideline pages and shortcuts can be misleading.",
            "If an editor violates the community standards described in policies and guidelines, other editors will warn the person to adhere to acceptable norms of conduct, though editors will resort to more forceful means if the behavior continues, such as administrator and steward actions. Gross violations are met with harder enforcement. Going against the principles set out on these pages, particularly policy pages, is unlikely to prove acceptable, although it may be possible to convince others an exception ought to be made. This means individual editors (including you) enforce and apply policies and guidelines.",
            "In cases where it is clear a user is acting against policy (or against a guideline in a way that conflicts with policy), especially if they are doing so intentionally and persistently, that user may be temporarily or indefinitely blocked from editing by an administrator. In cases where the dispute resolution procedure has been ineffective, the Arbitration Committee deals with highly disruptive or sensitive situations.",
            "Policy and guideline pages should:",
            "Wikipedia has many policies and guidelines about encyclopedic content. These standards require verifiability, neutrality, respect for living people, and more.",
            "The policies, guidelines, and process pages themselves are not part of the encyclopedia. They do not generally need to conform to the same content standards or style conventions as articles. It is not necessary to provide reliable sources to verify administrative pages, or to phrase procedures or principles in a neutral manner, or to cite an outside authority in determining editorial practices. Instead, the content of these pages is controlled by community-wide consensus, and the style should emphasize clarity, directness, and usefulness.[2]",
            "These pages do, however, need to comply with Wikipedia's legal and behavioral policies, as well as policies applicable to non-content pages. For example, editors may not violate copyrights anywhere on Wikipedia, and edit warring is prohibited everywhere, not merely in encyclopedia articles.",
            "Many of the most well-established policies and guidelines have developed from principles that have been accepted as fundamental since Wikipedia's inception. Others developed as solutions to common problems and disruptive editing. Policy and guideline pages are seldom established without precedent[3] and require strong community support. Policies and guidelines may be established through new proposals, promotion of essays or guidelines, and reorganization of existing policies and guidelines through splitting and merging.",
            "Essays and information pages may be established by writing them and adding {{essay}}, {{Information page}}, {{Wikipedia how-to}}, or a similar template to the page.",
            "Current policy and guideline proposals can be found in Category:Wikipedia proposals, and failed ones at Category:Wikipedia failed proposals. All editors are welcome to comment.",
            "Proposals for new guideline and policy pages require discussion and a high level of consensus from the entire community for promotion to guideline or policy status. Adding the {{policy}} template to a page without the required consensus does not mean the page is policy, even if the page summarizes or copies policy. Most commonly, a new policy or guideline documents existing practices, rather than proposing a change to what experienced editors already choose to do.",
            "One path for proposals is developing them through steps of",
            "The first step is to write the best initial proposal you can. Authors can request early-stage feedback at Wikipedia's village pump for idea incubation and from any relevant WikiProjects. Amendments to a proposal can be discussed on its talk page. It is crucial to improve a proposal in response to feedback received from outside editors. Consensus is built through a process of listening to and discussing the proposal with many other editors.",
            "Once you think the initial proposal is well written, and the issues involved have been sufficiently discussed among early participants to create a proposal that has a solid chance of success with the broader community, start a request for comment (RfC) about your policy or guideline proposal in a new section on the proposal's talk page. Include the {{rfc|policy}} tag, along with a brief, time-stamped explanation of the proposal. Then, if you want, you can provide a detailed explanation of what the page does and why you think it should be a policy or guideline. The {{Proposal}} template should be placed at the top of the proposed page; this tag will get the proposal properly categorized.",
            "The RfC should typically be announced at the policy and/or proposals village pumps, and you should notify other potentially interested groups. If your proposal affects a specific content area, then related WikiProjects can be found at the WikiProject directory. If your proposal relates to an existing policy or guideline, then leave a note on the talk page of the related policy or guideline. For example, proposed style guidelines should be announced at Wikipedia talk:Manual of Style, which is the main guideline for style issues. Try to identify the subcategory of guideline or policy (see {{Subcat guideline}} template). Proposals involving contentious subjects or wide-ranging effects should normally be listed on Wikipedia:Centralized discussion for the duration of the RfC. Rarely, a particularly important proposal may be advertised via a watchlist notice; sitenotices (which are displayed to all readers, not just to active editors) are not used for proposals. RfCs for policy and guideline proposals are normally left open for at least a week or sometimes a couple of months.",
            "To avoid later complaints about insufficient notice, it may be helpful to provide a complete list of the groups or pages you used to advertise the proposal on the talk page. Be careful not to canvass, and avoid non-neutral wording.",
            "Editors should respond to proposals in a way that helps identify and build consensus. Explain your thoughts, ask questions, and raise concerns. Many editors begin their responses with bold-font 'vote' of support or opposition to make evaluation easier.",
            "Closing a discussion requires careful evaluation of the responses to determine the consensus. This does not require the intervention of an administrator; it may be done by any sufficiently experienced impartial editor, not involved in the discussion, who is familiar with all policies and guidelines related to the proposal. The following points are important in evaluating consensus:",
            "Discussion may be closed as one of: Promote, No consensus, or Failed. Please leave a short note about the conclusion you came to. Update the proposal to reflect the consensus. Remove the {{Proposal}} template and replace it with another appropriate template, such as {{Subcat guideline}}, {{Policy}}, {{Supplement}}, {{essay}}, or {{Failed proposal}}. See Wikipedia namespace templates for a listing of banners.",
            "If a proposal fails, the failed tag should not usually be removed. It is typically more productive to rewrite a failed proposal from scratch to address problems or seek consensus to integrate uncontroversial aspects of it into existing pages, rather than to re-nominate a proposal.",
            "An accepted policy or guideline may become obsolete because of changes in editorial practice or community standards, may become redundant because of improvements to other pages, or may represent unwarranted instruction creep. In such situations editors may propose that a policy be demoted to a guideline, or that a policy or guideline be demoted to a supplement, informational page, essay or historical page. In certain cases, a policy or guideline may be superseded, in which case the old page is marked and retained for historical interest.",
            "The process for demotion is similar to promotion. A talk page discussion is typically started, the {{Under discussion|status|Discussion Title}} template is added to the top of the project page, and community input is solicited. After a reasonable amount of time for comments, an independent editor should close the discussion and evaluate the discussion and determine whether a consensus has formed to change the status.",
            "The {{Disputed tag}} template is typically used instead of {{Under discussion}} for claims that a page was recently assigned guideline or policy status without proper or sufficient consensus being established.",
            "Essays, information pages, and other informal pages that are supported by only a small minority of the community are typically moved to the primary author's userspace. These discussions typically happen on the page's talk page, sometimes with an RfC, but they have at times also been conducted at Miscellany for deletion (despite the MFD guidelines explicitly discouraging this practice). Other pages are retained for historical reference and are marked as such.",
            "Policies and guidelines can be edited like any other page. It is not strictly necessary to discuss changes or to obtain consensus in advance. However, because policies and guidelines are sensitive and complex, users should take care over any edits, to be sure they reflect the community's view and do not accidentally introduce confusion.",
            "The purpose of policies and guidelines is to state what most agree upon, and should be phrased to reflect the present consensus. Editing a policy/guideline/essay page does not in itself imply an immediate change to accepted practice. It is bad practice to recommend a rejected practice on a policy or guideline page.",
            "As explained below, update best practices by editing boldly or by working toward widespread consensus for the change through discussion.",
            "Implement. Before making substantive changes to policy and guideline pages, it is sometimes useful to try to establish a reasonable exception to the existing practice. To try to update the existing best practices this way, you may directly deviate from the established practice following the WP:IGNORE and WP:BOLD principles and make the change to mainspace pages. After some time, if there are no objections to the change and/or if a widespread consensus for your change or implementation is reached through discussion, you can then edit policy and guideline pages describing the practice to reflect the new situation.",
            "Talk first. Talk page discussion typically precedes substantive changes to a policy. Changes may be made if there are no objections or if the discussion shows there is consensus for the change. Minor edits for grammar and clarity can be made at any time.",
            "If the result of discussions is unclear, then it should be evaluated by an administrator or other independent editor, as in the proposal process. Major changes should also be publicized to the community in general; announcements may be appropriate.",
            "If wider input on a proposed change is desired, it may be useful to mark the section with the tag {{Under discussion|section|talk=Discussion Title}}. (If the proposal relates to a single statement, use {{Under discussion inline|Discussion Title}} immediately after it.)",
            "Or be bold. Although most editors find discussions helpful, especially at well-developed pages, directly editing these pages is permitted by Wikipedia's policies. Consequently, you should not remove any change solely because there was no discussion indicating consensus for the change before it was made. Instead, give a substantive reason for challenging it either in your edit summary or on the talk page.",
            "Bold editors of policy and guideline pages are strongly encouraged to follow WP:1RR or WP:0RR standards. Editing a policy to support your own argument in an active discussion may be seen as gaming the system, especially if you do not disclose it when making the edits.",
            "If policy and/or guideline pages conflict, one or more pages need to be revised to resolve the conflict so all the conflicting pages accurately reflect the community's actual practices and best advice. As a temporary measure, if a guideline appears to conflict with a policy, editors may assume the policy takes precedence.",
            "More commonly, advice pages do not directly conflict, but provide multiple options. For example, Wikipedia:Reliable sources says newspaper articles are generally considered to be reliable sources, and Wikipedia:Identifying reliable sources (medicine) recommends against newspaper articles for certain technical purposes. Editors must use their judgement to decide which advice is most appropriate and relevant to the situation at hand.",
            "The page names of policies and guidelines usually do not include the words \"policy\" or \"guideline\", unless required to distinguish the page from another.",
            "Policies and guidelines can be navigated via the directory, categories, the navigation template or by custom search boxes (as seen below)."
        ]
    },
    {
        "website_url": "https://en.wikipedia.org/wiki/Wikipedia:Consensus#Levels_of_consensus",
        "content": [
            "Consensus is Wikipedia's fundamental method of decision making. It involves an effort to address editors' legitimate concerns through a process of compromise while following Wikipedia's policies and guidelines. It is accepted as the best method to achieve the Five Pillars—Wikipedia's goals. Consensus on Wikipedia does not require unanimity (which is ideal but rarely achievable), nor is it the result of a vote.",
            "Editors usually reach consensus as a natural process. After one changes a page, others who read it can choose whether or not to further edit. When editors do not reach agreement by editing, discussion on the associated talk pages continues the process toward consensus.",
            "A consensus decision takes into account all of the proper concerns raised. Ideally, it arrives with an absence of objections, but often we must settle for as wide an agreement as can be reached. When there is no wide agreement, consensus-building involves adapting the proposal to bring in dissenters without losing those who accepted the initial proposal.",
            "Wikipedia consensus usually occurs implicitly. An edit has presumed consensus until it is disputed or reverted. Should another editor revise that edit, the new edit will have presumed consensus until it meets with disagreement. In this way, the encyclopedia gradually improves over time.",
            "All edits should be explained (unless the reason for them is obvious)—either by clear edit summaries, or by discussion on the associated talk page. Substantive, informative explanations indicate what issues must be addressed in subsequent efforts to reach consensus. Explanations are especially important when reverting another editor's good-faith work.",
            "Except in cases affected by content policies or guidelines, most disputes over content may be resolved through minor changes rather than taking an all-or-nothing position. If your first edit is reverted, try to think of a compromise edit that addresses the other editor's concerns. If you can't, or if you do and your second edit is reverted, create a new section on the associated talk page to discuss the dispute.",
            "Be bold, but not rash. Whether changes come through editing or through discussion, the encyclopedia is best improved through collaboration and consensus, not combat and capitulation. Repeated reversions are contrary to Wikipedia policy under edit warring, except for specific policy-based material (such as BLP exceptions) and reversions of vandalism. This is true even if editors are using edit summaries to \"discuss\" the dispute every time they revert.",
            "When agreement cannot be reached through editing alone, the consensus-forming process becomes more explicit: editors open a section on the associated talk page and try to work out the dispute through discussion, using reasons based in policy, sources, and common sense; they can also suggest alternative solutions or compromises that may satisfy all concerns. The result might be an agreement that may not satisfy everyone completely, but indicates the overall concurrence of the group. Consensus is an ongoing process on Wikipedia; it is often better to accept a less-than-perfect compromise—with the understanding that the page is gradually improving—than to try to fight to implement a particular preferred version immediately.",
            "When editors have a particularly difficult time reaching a consensus, several processes are available for consensus-building (third opinions, dispute resolution noticeboard, requests for comment), and even more extreme processes that will take authoritative steps to end the dispute (administrator intervention, arbitration). Keep in mind, however, that administrators are primarily concerned with policy and editor behavior and will not decide content issues authoritatively. They may block editors for behaviors that interfere with the consensus process (such as edit-warring, abuse of multiple accounts, or a lack of civility). They may also make decisions about whether edits are or are not allowable under policy, but will not usually go beyond such actions.",
            "Editors who maintain a neutral, detached, and civil attitude can usually reach consensus on an article through the process described above. They may still occasionally find themselves at an impasse, either because they cannot find rational grounds to settle a dispute or because one or both sides of the discussion become emotionally or ideologically invested in winning an argument. What follows are suggestions for resolving intractable disputes, along with descriptions of several formal and informal processes that may help.",
            "In determining consensus, consider the quality of the arguments, the history of how they came about, the objections of those who disagree, and existing policies and guidelines. The quality of an argument is more important than whether it represents a minority or a majority view. The arguments \"I just don't like it\" and \"I just like it\" usually carry no weight whatsoever.",
            "Limit article talk page discussions to discussion of sources, article focus, and policy. If an edit is challenged, or is likely to be challenged, editors should use talk pages to explain why an addition, change, or removal improves the article, and hence the encyclopedia. Consensus can be assumed if no editors object to a change. Editors who ignore talk page discussions yet continue to edit in or revert disputed material, or who stonewall discussions, may be guilty of disruptive editing and incur sanctions. Consensus cannot always be assumed simply because editors stop responding to talk page discussions in which they have already participated.",
            "The goal of a consensus-building discussion is to resolve disputes in a way that reflects Wikipedia's goals and policies while angering as few editors as possible. Editors with good social skills and good negotiation skills are more likely to be successful than those who are less than civil to others.",
            "When talk page discussions fail—generally because two editors (or two groups of editors) simply cannot see eye to eye on an issue—Wikipedia has several established processes to attract outside editors to offer opinions. This is often useful to break simple, good-faith deadlocks, because editors uninvolved in the discussion can bring in fresh perspectives, and can help involved editors see middle ground that they cannot see for themselves. The main resources for this are as follows:",
            "Many of these discussions will involve polls of one sort or another; but as consensus is determined by the quality of arguments (not by a simple counted majority), polls should be regarded as structured discussions rather than voting. Responses indicating individual explanations of positions using Wikipedia policies and guidelines are given the highest weight.",
            "In some cases, disputes are personal or ideological rather than mere disagreements about content, and these may require the intervention of administrators or the community as a whole. Sysops will not rule on content, but may intervene to enforce policy (such as WP:Biographies of living persons) or to impose sanctions on editors who are disrupting the consensus process. Sometimes merely asking for an administrator's attention on a talk page will suffice; as a rule, sysops have large numbers of pages watchlisted, and there is a likelihood that someone will see it and respond. However, there are established resources for working with intransigent editors, as follows:",
            "The following are common mistakes made by editors when trying to build consensus:",
            "Consensus is ascertained by the quality of the arguments given on the various sides of an issue, as viewed through the lens of Wikipedia policy.",
            "Consensus among a limited group of editors, at one place and time, cannot override community consensus on a wider scale. For instance, unless they can convince the broader community that such action is right, participants in a WikiProject cannot decide that some generally accepted policy or guideline does not apply to articles within its scope.",
            "WikiProject advice pages, how-to and information pages, template documentation pages, and essays have not gone through the policy and guideline proposal process and may or may not represent a broad community consensus.",
            "Wikipedia has a standard of participation and consensus for changes to policies and guidelines. Their stability and consistency are important to the community. Accordingly, editors often propose substantive changes on the talk page first to permit discussion before implementing the change. Undiscussed bold changes are permitted but rarely welcome on policy pages. Improvements to policy are best made slowly and conservatively, with active efforts to seek out input and agreement from others.",
            "What happens when a good faith discussion concludes with no agreement to take or not take an action? It depends on the context:",
            "Editors may propose a change to current consensus, especially to raise previously unconsidered arguments or circumstances. On the other hand, proposing to change a recently established consensus can be disruptive.",
            "Editors may propose a consensus change by discussion or editing. That said, in most cases, an editor who knows a proposed change will modify a matter resolved by past discussion should propose that change by discussion. Editors who revert a change proposed by an edit should generally avoid terse explanations (such as \"against consensus\") which provide little guidance to the proposing editor (or, if you do use such terse explanations, it is helpful to also include a link to the discussion where the consensus was formed).",
            "Certain policies and decisions made by the Wikimedia Foundation (WMF), its officers, and the Arbitration Committee of Wikipedia are outside the purview of editor consensus. This does not constitute an exhaustive list as much as a reminder that the decisions taken under this project apply only to the workings of the self-governing community of English Wikipedia.",
            "For a listing of ongoing discussions and current requests, see the dashboard.",
            "Information pages and Wikipedia essays concerning consensus:",
            "Articles concerning consensus:",
            "Five pillarsStatement of our principles",
            "Jimbo's statementHistoric principles",
            "Simplified rulesetSynopsis of our conventions",
            "Wikimedia principlesCommon to all projects(in Meta-Wiki)",
            "PrinciplesOther essays on Wikipedia's principles"
        ]
    }
]